{
	"fixes":
	{
		"activeEffectConditions": true,			/* Eliminate floating-point error from the elapsed time of active effects so that updates to their conditions will not be skipped. Disable this if Bug Fixes SSE is installed and FixAbilityConditionBug is enabled. */
		"harvestedFlags": true,					/* Flora and trees are saved when they respawn. */
		"hitEffectRaceCondition": true,			/* Eliminate a race condition that can prevent hit effects from being applied when an actors mesh is loaded after their magic effects. */
		"magicEffectFlags": true,				/* The effectiveness of magic effects is set correctly using their flags. */
		"modArmorWeightPerkEntryPoint": true,	/* Modify the weight of only worn armor using a perk entry point. */
		"speedMultUpdates": true,
		"terrainDecals": true,					/* Apply decals to terrain in cells that have been partially unloaded. */
		"trainingMenuText": true,				/* Display the correct cost of a lesson in the training menu when the relevant skill is buffed or debuffed. */
		"weaponCharge": true					/* The charge of equipped enchanted weapons can always be fully restored by magic effects. */
	},
	"patches":
	{
		"applySpellPerkEntryPoints":			/* Spells are not applied using perk entry points when the kill camera simulates the trajectory of an arrow. */
		{
			"castSpells": true,					/* Spells applied using perk entry points are cast by the source on the target. */
			"multipleSpells": true			/* Apply any number of spells at once using perk entry points. */
		},
		"attachHitEffectArt": true,			/* Hit effect art is attached when an actor is loaded. */
		"equipBestAmmo": true,				/* Automatically equip your best arrows or bolts when you equip a bow or crossbow. */
		"lockpickingExperience": true,			/* Earn experience each time you pick a lock. */
		"multipleHitEffects": true,			/* Each of a cloaking spells effects can apply hit effects. */
		"pausedGameHitEffects": true,			/* Apply any number of hit effects to the player while the game is paused. */
		"underfilledSoulGems": true			/* Trap only souls of the appropriate size in soul gems. */
	}
}
